import React from "react";

function Essay() {
  return (
    <div className="essayBox arabicFont">

      <div className="essayHeading">
        <h2>العنوان هنا يا صديقي</h2>
      </div>

<div className="essayContents note">
<h3>المحتويات:</h3>
  <ul>
    <li>  <a alternate="First thing" href="#firstThing"> الشيء الأول </a> </li>
    <li>  <a alternate="Second thing" href="#secondThing">الشيء الثاني</a> </li>
    <li>  <a alternate="Third thing" href="#thirdThing">الشيء الثالث</a> </li>
  </ul>
</div>


      <div className="essayBody">
      <h3 id="firstThing">الشيء الأول</h3>
      <p>
      <span lang="ar">
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من منصة قالب جاهز ، حيث يمكنك أنا استخدام هذا النص و مثل هذا النص أو العديد من النصوص الأخرى و إضافة و زيادة عدد الحروف التى تخطر في بالك.

إذا كنت تحتاج إلى عدد أكبر من الفقرات بامكانك نسخ هذه الفقرة لـ زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، هذا النص مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.


هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.
      </span>
      </p>

      <h3 id="secondThing">الشيء الثاني</h3>
      <p>
      <span lang="ar">

إذا كنت تحتاج إلى عدد أكبر من الفقرات بامكانك نسخ هذه الفقرة لـ زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، هذا النص مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.

ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً، ولهذا تقدم لك منصة قالب جاهز  نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.

      </span>
      </p>

      <h3 id="thirdThing">الشيء الثالث</h3>
      <p>
      <span lang="ar">


ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً، ولهذا تقدم لك منصة قالب جاهز  نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.

هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.
      </span>
      </p>


      </div>

    </div>
  );
}

export default Essay;
